In [19]:
import pandas as pd
import plotly_express as px 

Athlete_events = pd.read_csv("Data/athlete_events.csv")
Noc_regions = pd.read_csv("Data/noc_regions.csv")

df_athlete = pd.DataFrame(Athlete_events)
df_regions = pd.DataFrame(Noc_regions)
df_athlete.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [21]:
# 4 sports to study, basketball, football, ice hockey, and boxing

In [27]:
# basketball
df_basketball = df_athlete[df_athlete['Sport'] == 'Basketball']
df_basketball = df_basketball[df_basketball['Medal'] == 'Gold']
df_basketball = df_basketball.groupby('Team').count()
df_basketball

,ID,Name,Sex,Age,Height,Weight,NOC,Games,Year,Season,City,Sport,Event,Medal
Team,,,,,,,,,,,,,,
Argentina,12,12,12,12,12,12,12,12,12,12,12,12,12,12
Soviet Union,48,48,48,48,48,48,48,48,48,48,48,48,48,48
Unified Team,12,12,12,12,11,9,12,12,12,12,12,12,12,12
United States,281,281,281,281,281,281,281,281,281,281,281,281,281,281
Yugoslavia,12,12,12,12,12,11,12,12,12,12,12,12,12,12

Note: the Unified Team is the name used for the sports team of the former Soviet Union at the 1992 Winter Olympics in Albertville and the 1992 Summer Olympics in Barcelona
- source: https://en.wikipedia.org/wiki/Unified_Team_at_the_Olympics